---
Description: Provide the path to the dmg to AutoPkg with the -p switch, for example autopkg run RXPostProductionSuite.download.recipe.yaml -p ~/Downloads/iZotope_RX_Post_Production_Suite_v6_2_1.dmg
Identifier: com.github.w0.download.rxpostproductionsuite
MinimumVersion: "2.3"

Input:
  NAME: iZotope RX Post Production Suite

Process: 
  - Processor: PackageRequired
  
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%PKG%/Install *.app"
      requirement: anchor apple generic and identifier "com.izotope.pps6" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = QGULMAPEB2

  - Processor: EndOfCheckPhase
