---
Description: Creates an apple pkg from a downloaded disk-image.
Identifier: com.github.w0.pkg.SonicVisualiser
MinimumVersion: "2.3"
ParentRecipe: com.github.hansen-m.download.SonicVisualiser

Input:
  NAME: SonicVisualiser

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%"
  
  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Applications/Sonic Visualiser.app"
      source_path: "%pathname%/*.app"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%bundleid%"
        version: "%version%"
        options: purge_ds_store
        pkgdir: "%RECIPE_CACHE_DIR%"
      pkgname: "%NAME%-%version%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/%NAME%"