Description: Downloads the cura-lulzbot diskimage
Identifier: com.github.w0.download.cura-lulzbot
Input:
  NAME: cura-lulzbot
MinimumVersion: '2.3'
Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: (https?:)?//(software\.lulzbot\.com/MacOSX/Cura%20LulzBot%20Edition%20[\d\.]+/[\d\.]+/Cura_LulzBot_Edition[_-][\d\.]+.dmg)
      url: https://www.lulzbot.com/learn/tutorials/cura-lulzbot-edition-installation-macos

  - Processor: URLDownloader
    Arguments:
      url: https://%match%

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/*.app"
      requirement: identifier "com.lulzbot.curale" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Y874P4NL3A

  - Processor: EndOfCheckPhase
