Description: Downloads the cura-lulzbot diskimage
Identifier: com.github.w0.download.cura-lulzbot
Input:
  NAME: cura-lulzbot
MinimumVersion: '2.3'
Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: (https?:)?//(software\.lulzbot\.com/MacOSX/Cura%20LulzBot%20Edition%20[\d\.]+/[\d\.]+/Cura_LulzBot_Edition[_-][\d\.]+.dmg)
      url: https://www.lulzbot.com/learn/tutorials/cura-lulzbot-edition-installation-macos

  - Processor: URLDownloader
    Arguments:
      url: https://%match%

  - Processor: EndOfCheckPhase
