---
Description: Provide the path to the dmg to AutoPkg with the -p switch, for example autopkg run Iris.download.recipe.yaml -p ~/Downloads/iZotope_Iris_v2_0_2d.dmg
Identifier: com.github.w0.download.iris
MinimumVersion: "2.3"

Input:
  NAME: iZotope Iris

Process: 
  - Processor: PackageRequired
  
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%PKG%/Install *.app"
      requirement: anchor apple generic and identifier "com.izotope.audioplugins.Iris2" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = QGULMAPEB2

  - Processor: EndOfCheckPhase
