---
Description: Creates a apple pkg from a downloaded disk-image file. 
Identifier: com.github.w0.recipes.pkg.stratus
MinimumVersion: "2.3"
ParentRecipe: com.github.w0.download.stratus

Input: 
  NAME: iZotope Stratus

Process: 
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%PKG%"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
  
  - Processor: Copier
    Arguments:
      source_path: "%PKG%/Install *.app"
      destination_path: "%RECIPE_CACHE_DIR%/Scripts/Install %NAME%.app"
      overwrite: true
  
  - Processor: FileCreator
    Arguments:
      file_path: "%RECIPE_CACHE_DIR%/Scripts/postinstall"
      file_mode: "0755"
      file_content: |
          #!/bin/bash

          # Determine working directory
          install_dir=$(dirname $0)

          # Install the %NAME% app and configure it
          "${install_dir}/Install %NAME%.app/Contents/MacOS/installbuilder.sh" --mode unattended

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown: []
        id: com.izotope.stratus
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        scripts: Scripts
        version: "%version%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/Scripts"
        - "%RECIPE_CACHE_DIR%/pkgroot"