---
Description: Creates a apple pkg from a downloaded disk-image file. 
Identifier: com.github.w0.pkg.rapidminerstudio
MinimumVersion: "2.3"
ParentRecipe: com.github.w0.download.rapidminerstudio

Input: 
  NAME: RapidMiner Studio

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"

  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Applications/RapidMiner Studio.app"
      source_path: "%pathname%/*.app"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%bundleid%"
        version: "%version%"
        options: purge_ds_store
        pkgdir: "%RECIPE_CACHE_DIR%"
      pkgname: "%NAME%-%version%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/pkgroot"
        - "%RECIPE_CACHE_DIR%/downloads"