---
Description: Downloads the latest RapidMiner Studio dmg and verifies its signature.
Identifier: com.github.w0.download.rapidminerstudio
MinimumVersion: "2.3"

Input:
  NAME: RapidMiner Studio

Process:
  - Processor: URLDownloader
    Arguments:
      url: https://pages.rapidminer.com/latest-studio-mac-download.html
      filename: RapidMinerStudio.dmg

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/*.app"
      requirement: identifier "com.rapidminer.studio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "3GRYJJQEPU"
