---
Description: Provide the path to the dmg to AutoPkg with the -p switch, for example autopkg run RXAdvanced.download.recipe.yaml -p ~/Downloads/iZotope_RX_9_Audio_Editor_Advanced_v9_3_0.dmg
Identifier: com.github.w0.download.rxadvanced
MinimumVersion: "2.3"

Input:
  NAME: iZotope RX Audio Editor Advanced

Process: 
  - Processor: PackageRequired
  
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%PKG%/Install *.app"
      requirement: anchor apple generic and identifier "com.izotope.installer.RX-9-Audio-Editor-Advanced" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = QGULMAPEB2

  - Processor: EndOfCheckPhase
