---
Description: Downloads the latest Auto-Tune Central disk-image.
Identifier: com.github.w0.download.autotunecentral
MinimumVersion: "2.3"

Input:
  NAME: Auto-Tune Central

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: "[0-9.]+"
      url: https://antares.sfo2.digitaloceanspaces.com/auto-tune-central/auto-update/mac/latest-mac.yml 
  
  - Processor: URLDownloader
    Arguments:
      url: "https://antares.sfo2.cdn.digitaloceanspaces.com/auto-tune-central/auto-update/mac/Auto_Tune_Central_%match%_universal.dmg"
  
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/*.app"
      requirement: anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EWQDQRUXQ8

  - Processor: EndOfCheckPhase
