---
Description: Downloads the latest Auto-Tune Central disk-image.
Identifier: com.github.w0.download.autotunecentral
MinimumVersion: "2.3"

Input:
  NAME: Auto-Tune Central

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: https://antares.sfo2.cdn.digitaloceanspaces.com/auto-tune-central/auto-update/mac/Auto_Tune_Central_[0-9.]+_universal.dmg
      url: https://www.antarestech.com/js/chunk-2d0d0918.076148aa.js
  
  - Processor: URLDownloader
    Arguments:
      url: "%match%"
  
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/*.app"
      requirement: anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EWQDQRUXQ8

  - Processor: EndOfCheckPhase
